-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2018-06-11 06:10:23
-- 服务器版本： 5.7.14
-- PHP Version: 7.0.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `workload`
--
CREATE DATABASE IF NOT EXISTS `workload` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `workload`;

-- --------------------------------------------------------

--
-- 表的结构 `department`
--

CREATE TABLE `department` (
  `id` int(11) NOT NULL COMMENT '主键',
  `departmentName` varchar(32) NOT NULL COMMENT '部门名称',
  `dutyPerson` varchar(32) NOT NULL COMMENT '责任人'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `department`
--

INSERT INTO `department` (`id`, `departmentName`, `dutyPerson`) VALUES
(1, '办公室', '韩晓华'),
(2, '软件教研室', '崔宇'),
(3, '网络教研室', '刘卓华'),
(4, '广告设计教研室', '林琳'),
(5, '室内设计教研室', '谢志贤'),
(6, '工业设计教研室', '蔡晓红'),
(7, '实训中心', '李剑峰');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'id',
  `username` varchar(20) NOT NULL COMMENT '用户名',
  `userId` varchar(30) NOT NULL COMMENT '用户ID',
  `role` varchar(10) NOT NULL COMMENT '用户类型',
  `name` varchar(32) NOT NULL COMMENT '姓名',
  `departmentName` varchar(32) DEFAULT NULL COMMENT '部门',
  `password` varchar(48) NOT NULL COMMENT '密码',
  `status` tinyint(4) NOT NULL COMMENT '状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `userId`, `role`, `name`, `departmentName`, `password`, `status`) VALUES
(2, 'administrator', '1111111', '管理员', 'hhh', '办公室', '7c4a8d09ca3762af61e59520943dc26494f8941b', 1),
(7, '00207', '', '教师', '胡泽军', '软件教研室', '7c4a8d09ca3762af61e59520943dc26494f8941b', 1),
(8, '2004040041', '2088512762727244', '教师', '张三', '实训中心', '7c4a8d09ca3762af61e59520943dc26494f8941b', 0),
(10, '2004040043', '', '管理员', '王五', '工业设计教研室', '7c4a8d09ca3762af61e59520943dc26494f8941b', 0),
(11, '2004040042', '', '教师', '李四', '广告设计教研室', '7c4a8d09ca3762af61e59520943dc26494f8941b', 1),
(12, '123456789', '', '管理员', '马云', '实训中心', '7c4a8d09ca3762af61e59520943dc26494f8941b', 0);

-- --------------------------------------------------------

--
-- 表的结构 `work`
--

CREATE TABLE `work` (
  `id` int(11) NOT NULL COMMENT '主键',
  `year` varchar(4) NOT NULL COMMENT '材料年度',
  `teacherId` varchar(20) NOT NULL COMMENT '教工号',
  `typeName` varchar(32) NOT NULL COMMENT '类别名称',
  `rankName` varchar(20) NOT NULL COMMENT '级别名',
  `content` varchar(500) NOT NULL COMMENT '内容',
  `amount` int(11) NOT NULL COMMENT '数量',
  `classHour` int(11) DEFAULT NULL COMMENT '折算课时',
  `money` int(11) DEFAULT NULL COMMENT '奖励金额',
  `evidence` varchar(200) DEFAULT NULL COMMENT '证明材料',
  `remarks` varchar(200) DEFAULT NULL COMMENT '备注',
  `recorder` varchar(32) NOT NULL COMMENT '记录人',
  `status` varchar(2) NOT NULL COMMENT '状态'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `work`
--

INSERT INTO `work` (`id`, `year`, `teacherId`, `typeName`, `rankName`, `content`, `amount`, `classHour`, `money`, `evidence`, `remarks`, `recorder`, `status`) VALUES
(1, '2018', '00207', '论文', '一般刊物', '白白白白白白白白白白白白白白', 1, 12, 333, 'rrrrrrrrrrrrrrrrrrrrrrr', 'qrwrqerqewrer', 'administrator', '确认'),
(22, '2018', '2004040043', '年度考核优秀', '校级', 'dafadfasf', 1, 0, 200, NULL, NULL, 'administrator', '确认'),
(16, '2018', '2004040043', '年度考核优秀', '系级', 'dddd', 1, 0, 300, NULL, NULL, 'administrator', '确认'),
(15, '2018', '2004040041', '年度考核优秀', '校级', 'eeee', 1, 0, 200, NULL, NULL, '00207', '保存'),
(8, '2018', '', '兼职辅导员', '校级', 'sss', 1, NULL, NULL, NULL, NULL, '00207', '保存'),
(9, '2018', '', '临时任务', '校级', 'eeee', 1, 4, 5, NULL, NULL, '00207', '保存'),
(10, '2018', '2004040043', '专业主任', '校级', 'eeee', 1, 80, 0, NULL, NULL, '00207', '保存'),
(14, '2018', '2004040042', '专业带头人', '校级', 'ffff', 1, 40, 0, NULL, NULL, '00207', '保存'),
(12, '2018', '2004040042', '出现教学事故', '校级', 'rrrrrrrrrr', 1, 0, 44, NULL, NULL, '00207', '保存'),
(13, '2018', '2004040042', '年度考核优秀', '系级', 'ttt', 1, 0, 300, NULL, NULL, '00207', '保存'),
(17, '2018', '2004040042', '企业锻炼', '校级', 'eeeee', 1, 20, 444, NULL, NULL, '00207', '保存'),
(18, '2018', '2004040042', '调研报告', '校级', 'gggg', 1, 10, 200, NULL, NULL, '00207', '保存'),
(19, '2018', 'administrator', '大型讲座', '500人', 'sfgsf', 1, 10, 300, NULL, NULL, '00207', '保存'),
(20, '2018', '123456789', '教学技能竞赛', '校级', '西城末', 1, 44, 44, NULL, NULL, '00207', '保存'),
(21, '2018', '00207', '科研课题', '市级立项', '预录取绿化发', 1, 40, 200, NULL, NULL, '00207', '保存'),
(23, '2018', '2004040043', '年度考核优秀', '校级', 'sdfsdsdf', 1, 0, 200, NULL, NULL, '00207', '保存'),
(24, '2016', '2004040043', '临时任务', '校级', 'sfgsdfgsfgsdfgsfgsdfg', 1, 22, 22, NULL, NULL, 'administrator', '确认'),
(25, '2018', '00207', '论文', '核心期刊', '白白352446546', 1, 20, 300, NULL, NULL, '00207', '保存'),
(26, '2018', '2004040042', '兼职辅导员', '校级', 'uuuuuuuuuuu', 1, 60, 0, NULL, NULL, '00207', '保存'),
(27, '2018', '', '校外实训基地', '校级', '大大dddd', 1, 20, 200, NULL, NULL, '00207', '保存'),
(28, '2018', '2004040042', '校外实训基地', '校级', '大大大', 1, 20, 200, NULL, NULL, '00207', '保存'),
(29, '2018', '00207', '修订课程大纲', '校级', '大大大dd', 1, 2, 0, NULL, NULL, '00207', '保存'),
(30, '2018', '2004040043', '企业上课', '校级', '大大大', 1, 1, 0, NULL, NULL, '00207', '保存'),
(31, '2018', '2004040041', '临时任务', '校级', 'sgsdgsdfg', 1, 333, 333, NULL, NULL, '00207', '保存'),
(32, '2018', '00207', '临时任务', '校级', 'sadfadsfasdf', 1, 11, 22, NULL, NULL, '00207', '保存');

-- --------------------------------------------------------

--
-- 表的结构 `worktype`
--

CREATE TABLE `worktype` (
  `id` int(11) NOT NULL COMMENT '主键',
  `bigType` varchar(30) NOT NULL COMMENT '大类',
  `typeName` varchar(32) NOT NULL COMMENT '类别名',
  `rank` varchar(32) NOT NULL COMMENT '级别',
  `content` varchar(500) NOT NULL COMMENT ' 内容',
  `unit` varchar(8) NOT NULL COMMENT '单位',
  `classHour` varchar(200) NOT NULL COMMENT '课时',
  `price` varchar(200) NOT NULL COMMENT '价格',
  `memo` varchar(100) DEFAULT NULL COMMENT '备注'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `worktype`
--

INSERT INTO `worktype` (`id`, `bigType`, `typeName`, `rank`, `content`, `unit`, `classHour`, `price`, `memo`) VALUES
(14, '基本考核', '听课任务', '校级', '不超过规定次数的听课任务', '次', '{"C":"0","L":"","H":"","TL":"","TH":""}', '{"C":"30","L":"","H":"","TL":"","TH":""}', NULL),
(19, '科研', '论文', '核心期刊', '核心期刊、国家重要报纸（学术、理论版）、一般索引全文转载', '', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(13, '基本考核', '年度考核优秀', '系级', '年度考核优秀', '次', '{"C":"0","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(12, '基本考核', '年度考核优秀', '校级', '年度考核优秀', '次', '{"C":"0","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(18, '科研', '论文', '一般刊物', '一般刊物（含外国）、省级重要报纸（学术、理论版）、一般索引', '', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(15, '基本考核', '出现教学事故', '校级', '没有教学事故，以及不出现旷工、迟到、早退、事假现象的在编专任教师和专职外聘教师,按照学校规定扣发金额减发，到扣完为止；', '次', '{"C":"0","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"","TL":"0","TH":"1000"}', NULL),
(16, '基本考核', '缺交教学资料', '校级', '按时按质提交教学资料的在编专任教师和专职外聘教师。每缺一项减发50元到扣完为止', '次', '{"C":"0","L":"","H":"","TL":"","TH":""}', '{"C":"-50","L":"","H":"","TL":"0","TH":"1000"}', NULL),
(17, '临时任务', '临时任务', '校级', '经学院发放非授课工作量酬金发放小组讨论通过，给予相应奖励、补贴', '', '{"C":"","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"","TL":"","TH":""}', NULL),
(20, '科研', '论文', '权威期刊', '权威期刊（含外国）、重要索引', '', '{"C":"40","L":"","H":"","TL":"","TH":""}', '{"C":"500","L":"","H":"","TL":"","TH":""}', NULL),
(21, '科研', '教材著作', '校内教材', '经批准的院内一般教材（含译著）', '', '{"C":"3","L":"","H":"","TL":"","TH":""}', '{"C":"20","L":"","H":"","TL":"","TH":""}', NULL),
(22, '科研', '教材著作', '一般教材', '经批准的公开出版的一般教材（含译著）', '', '{"C":"3","L":"","H":"","TL":"","TH":""}', '{"C":"20","L":"","H":"","TL":"","TH":""}', NULL),
(23, '科研', '教材著作', '专著', '经批准公开出版的专著', '', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"20","L":"","H":"","TL":"","TH":""}', NULL),
(24, '科研', '教材著作', '工学结合教材', '经学院立项公开出版的工学结合教材', '', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"20","L":"","H":"","TL":"","TH":""}', NULL),
(25, '科研', '科研课题', '校级', '校级一般项目', '', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(26, '科研', '科研课题', '校级重点', '校级重点项目', '', '{"C":"30","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(27, '科研', '科研课题', '横向立项', '横向立项课题', '', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"300","TL":"","TH":""}', NULL),
(28, '科研', '科研课题', '市级立项', '市级立项课题', '', '{"C":"40","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(29, '科研', '科研课题', '省级立项', '省级立项课题', '', '{"C":"150","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(30, '科研', '科研课题', '国家级立项', '国家级立项课题', '', '{"C":"300","L":"","H":"","TL":"","TH":""}', '{"C":"500","L":"","H":"","TL":"","TH":""}', NULL),
(31, '科研', '立项专利', '发明受理', '发明专利（受理）', '', '{"C":"5","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(32, '科研', '立项专利', '发明授权', '发明专利（授权）', '', '{"C":"60","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(33, '科研', '立项专利', '新型受理', '实用新型专利（受理）', '', '{"C":"5","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(34, '科研', '立项专利', '新型授权', '实用新型专利（授权）', '', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(35, '科研', '立项专利', '外观授权', '外观设计专利（授权）', '', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(36, '科研', '教科研成 果奖', '校级', '校级教科研成 果奖', '', '{"C":"","L":"10","H":"30","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(37, '科研', '教科研成 果奖', '省级', '省级', '', '{"C":"","L":"50","H":"150","TL":"","TH":""}', '{"C":"500","L":"","H":"","TL":"","TH":""}', NULL),
(38, '科研', '教科研成 果奖', '国家级', '国家级', '', '{"C":"","L":"100","H":"300","TL":"","TH":""}', '{"C":"1000","L":"","H":"","TL":"","TH":""}', NULL),
(39, '技能竞赛', '教学技能竞赛', '校级', '表现优秀者', '', '{"C":"","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"","TL":"","TH":""}', NULL),
(40, '技能竞赛', '专项技能竞赛', '省级', '省级', '', '{"C":"","L":"20","H":"50","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(41, '技能竞赛', '专项技能竞赛', '国家级', '国家级', '', '{"C":"","L":"100","H":"300","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(42, '技能竞赛', '竞赛教练奖', '省级', '省级', '', '{"C":"","L":"20","H":"100","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(43, '技能竞赛', '竞赛教练奖', '国家级', '国家级', '', '{"C":"","L":"100","H":"200","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(44, '其它工作', '兼职辅导员', '校级', '兼职辅导员', '', '{"C":"60","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(45, '其它工作', '专业主任', '校级', '专业主任', '', '{"C":"80","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(46, '其它工作', '专业带头人', '校级', '专业带头人', '', '{"C":"40","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(47, '专业建设', '调研报告', '校级', '经批准的企业、社会调研（有3000字以上的调研报告）', '次', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(48, '校外指导', '下企业指导', '广州市内', '下企业指导学生', '次', '{"C":"1","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"","TL":"","TH":""}', NULL),
(49, '校外指导', '下企业指导', '广州市外', '下企业指导学生', '次', '{"C":"2","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"","TL":"","TH":""}', NULL),
(50, '校外指导', '企业上课', '校级', '根据人才培养方案，在企业上课', '次', '{"C":"1","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(51, '校外指导', '培训讲座', '校级', '为企业员工进行培训或讲座', '次', '{"C":"1","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"400","TL":"","TH":""}', NULL),
(52, '校外指导', '推荐学生实践', '校级', '推荐每个学生进入企业生产实践', '次', '{"C":"1","L":"","H":"","TL":"","TH":""}', '{"C":"50","L":"","H":"","TL":"","TH":""}', NULL),
(53, '校外指导', '推荐学生就业', '校级', '推荐每个学生进入企业就业', '次', '{"C":"3","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(54, '院校建设', '校外实训基地', '校级', '成功联系校外实训基地（签协议\r\n为准）并已接收学生实习\r\n', '个', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(55, '院校建设', '校企合作', '校级', '与世界500强或中国500强或广东竞争力50强企业签协议', '个', '{"C":"40","L":"","H":"","TL":"","TH":""}', '{"C":"600","L":"","H":"","TL":"","TH":""}', NULL),
(56, '院校建设', '捐赠设备', '校级', '引进社会捐赠设备', '次', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"600","TL":"","TH":""}', NULL),
(57, '院校建设', '厂中校', '校级', '牵线企业，推动“厂中校”建设', '个', '{"C":"40","L":"","H":"","TL":"","TH":""}', '{"C":"500","L":"","H":"","TL":"","TH":""}', NULL),
(58, '院校建设', '校中厂', '校级', '牵线企业，推动“校中厂”建设', '个', '{"C":"40","L":"","H":"","TL":"","TH":""}', '{"C":"500","L":"","H":"","TL":"","TH":""}', NULL),
(59, '其它工作', '大型讲座', '200人', '大型讲座（200人左右跨年级或专业）', '', '{"C":"5","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(60, '其它工作', '大型讲座', '500人', '大型讲座（500人左右跨系部）', '', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(61, '其它工作', '企业锻炼', '校级', '到企业锻炼', '', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"","TL":"","TH":""}', NULL),
(62, '专业建设', '实训室建设', '校级', '制定新实训（验）室建议方案，并完成其方案的实施（含市场研究）', '个', '{"C":"","L":"20","H":"50","TL":"","TH":""}', '{"C":"","L":"100","H":"","TL":"","TH":""}', NULL),
(63, '专业建设', '修订人才培养方案', '校级', '修订专业人才培养方案', '个', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(64, '专业建设', '制定人才培养方案', '校级', '制定新专业人才培养方案', '个', '{"C":"20","L":"","H":"","TL":"","TH":""}', '{"C":"800","L":"","H":"","TL":"","TH":""}', NULL),
(65, '课程建设', '修订课程大纲', '校级', '修订课程教学大纲', '个', '{"C":"2","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(66, '课程建设', '制定课程标准', '校级', '制定课程标准', '个', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(67, '课程建设', '修订课程标准', '校级', '修订课程标准', '个', '{"C":"4","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(68, '其它工作', '监考', '校级', '监考', '', '{"C":"1","L":"","H":"","TL":"","TH":""}', '{"C":"","L":"","H":"","TL":"","TH":""}', NULL),
(69, '其它工作', '出卷', '校级', '出卷', '', '{"C":"3","L":"","H":"","TL":"","TH":""}', '{"C":"150","L":"","H":"","TL":"","TH":""}', NULL),
(70, '其它工作', '改卷奖励', '校级', '改卷奖励', '', '{"C":"0","L":"","H":"","TL":"","TH":""}', '{"C":"3","L":"","H":"","TL":"","TH":""}', NULL),
(71, '其它工作', '改卷课时', '校级', '改卷课时折算', '', '{"C":"3","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(72, '专业建设', '专业建设规划', '校级', '制定专业建设规划', '个', '{"C":"15","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(73, '专业建设', '专业教育', '校级', '专业教育', '次', '{"C":"2","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(74, '其它工作', '指导青年教师', '校级', '指导青年教师', '', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(75, '其它工作', '毕业综合实践', '校级', '指导学生毕业综合实践', '', '{"C":"2","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(76, '技能竞赛', '第二课堂', '院级', '指导院级比赛', '个', '{"C":"5","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(77, '技能竞赛', '第二课堂', '省级', '指导省级比赛', '个', '{"C":"10","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(78, '技能竞赛', '第二课堂', '国家级', '指导国家级比赛', '个', '{"C":"15","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(79, '技能竞赛', '第二课堂', '校级', '院级评委', '个', '{"C":"0","L":"","H":"","TL":"","TH":""}', '{"C":"100","L":"","H":"","TL":"","TH":""}', NULL),
(80, '专业建设', '专业教学指导书', '校级', '编制专业教学指导书', '份', '{"C":"5","L":"","H":"","TL":"","TH":""}', '{"C":"200","L":"","H":"","TL":"","TH":""}', NULL),
(81, '专业建设', '品牌专业申报', '省级', '省品牌建设专业申报成功', '个', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(82, '专业建设', '实训基地申报', '省级', '省级实训基地材料撰写成功', '个', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(83, '专业建设', '实训基地申报', '省级', '省级实训基地申报成功', '个', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(84, '专业建设', '实训基地申报', '国家级', '国家级实训基地申报成功', '个', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(85, '课程建设', '精品课程', '校级', '校级精品课申报成功', '个', '{"C":"80","L":"","H":"","TL":"","TH":""}', '{"C":"300","L":"","H":"","TL":"","TH":""}', NULL),
(86, '专业建设', '品牌专业申报', '省级', '省品牌建设专业申报.失败', '个', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"1000","L":"","H":"","TL":"","TH":""}', NULL),
(87, '专业建设', '实训基地申报', '省级', '省级实训基地申报.失败', '个', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"1000","L":"","H":"","TL":"","TH":""}', NULL),
(88, '专业建设', '实训基地申报', '省级', '省级实训基地材料撰写.失败', '', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"1000","L":"","H":"","TL":"","TH":""}', NULL),
(89, '专业建设', '实训基地申报', '国家级', '国家级实训基地申报.失败', '个', '{"C":"50","L":"","H":"","TL":"","TH":""}', '{"C":"1000","L":"","H":"","TL":"","TH":""}', NULL),
(90, '课程建设', '精品课程', '校级', '校级精品课申报.失败', '', '{"C":"80","L":"","H":"","TL":"","TH":""}', '{"C":"1000","L":"","H":"","TL":"","TH":""}', NULL),
(91, '课程建设', '精品课程', '省级', '省级精品课申报成功', '个', '{"C":"70","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL),
(92, '课程建设', '精品课程', '省级', '省级精品课申报.失败', '个', '{"C":"70","L":"","H":"","TL":"","TH":""}', '{"C":"500","L":"","H":"","TL":"","TH":""}', NULL),
(93, '课程建设', '精品课程', '国家级', '国家级精品课成功', '个', '{"C":"100","L":"","H":"","TL":"","TH":""}', '{"C":"0","L":"","H":"","TL":"","TH":""}', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `department`
--
ALTER TABLE `department`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `departmentName` (`departmentName`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `work`
--
ALTER TABLE `work`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `worktype`
--
ALTER TABLE `worktype`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `department`
--
ALTER TABLE `department`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=8;
--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'id', AUTO_INCREMENT=13;
--
-- 使用表AUTO_INCREMENT `work`
--
ALTER TABLE `work`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=33;
--
-- 使用表AUTO_INCREMENT `worktype`
--
ALTER TABLE `worktype`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=96;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
